In [ ]:
import pandas as pd 
import numpy as np

In [45]:
data = pd.read_csv('disposition.csv')

In [46]:
data.isnull().sum()

disp_id       0
client_id     0
account_id    0
type          0
dtype: int64

In [47]:
data.duplicated().sum()

np.int64(0)

In [48]:
data['type'].value_counts()

type
OWNER        4500
DISPONENT     869
Name: count, dtype: int64

In [49]:
df = pd.read_csv('order.csv', delimiter=';')

In [50]:
df

      order_id  account_id bank_to  account_to  amount  k_symbol
0        29401           1      YZ    87144583  2452.0      SIPO
1        29402           2      ST    89597016  3372.7      UVER
2        29403           2      QR    13943797  7266.0      SIPO
3        29404           3      WX    83084338  1135.0      SIPO
4        29405           3      CD    24485939   327.0
...        ...         ...     ...         ...     ...       ...
6466     46334       11362      YZ    70641225  4780.0      SIPO
6467     46335       11362      MN    78507822    56.0
6468     46336       11362      ST    40799850   330.0  POJISTNE
6469     46337       11362      KL    20009470   129.0
6470     46338       11362      MN    61540514  5392.0      UVER

[6471 rows x 6 columns]

In [51]:
df.duplicated().sum()

np.int64(0)

In [52]:
df.isnull().sum()

order_id      0
account_id    0
bank_to       0
account_to    0
amount        0
k_symbol      0
dtype: int64

In [53]:
df['k_symbol'].value_counts()

k_symbol
SIPO        3502
            1379
UVER         717
POJISTNE     532
LEASING      341
Name: count, dtype: int64

In [54]:
df['k_symbol']= df['k_symbol'].replace(' ', 'Unknown')

In [55]:
df['k_symbol'].value_counts()

k_symbol
SIPO        3502
Unknown     1379
UVER         717
POJISTNE     532
LEASING      341
Name: count, dtype: int64

In [56]:
df['k_symbol']= df['k_symbol'].map({'SIPO': 'Household Payment', 'UVER':'Loan Payment', 'LEASING': 'Leasing Payment', 'POJISTNE':'Insurence payment'})

In [57]:
df['k_symbol'].value_counts()

k_symbol
Household Payment    3502
Loan Payment          717
Insurence payment     532
Leasing Payment       341
Name: count, dtype: int64

In [58]:
df = df.rename(columns={'k_symbol':'Payment Type'})

In [59]:
df['Payment Type']= df['Payment Type'].replace(np.nan, 'Unknown')

In [60]:
df['Payment Type'].value_counts()

Payment Type
Household Payment    3502
Unknown              1379
Loan Payment          717
Insurence payment     532
Leasing Payment       341
Name: count, dtype: int64

In [61]:
df

      order_id  account_id bank_to  account_to  amount       Payment Type
0        29401           1      YZ    87144583  2452.0  Household Payment
1        29402           2      ST    89597016  3372.7       Loan Payment
2        29403           2      QR    13943797  7266.0  Household Payment
3        29404           3      WX    83084338  1135.0  Household Payment
4        29405           3      CD    24485939   327.0            Unknown
...        ...         ...     ...         ...     ...                ...
6466     46334       11362      YZ    70641225  4780.0  Household Payment
6467     46335       11362      MN    78507822    56.0            Unknown
6468     46336       11362      ST    40799850   330.0  Insurence payment
6469     46337       11362      KL    20009470   129.0            Unknown
6470     46338       11362      MN    61540514  5392.0       Loan Payment

[6471 rows x 6 columns]

In [62]:
df.to_csv("Orders_cleaned.csv")

In [63]:
df1=pd.read_csv('client.csv', delimiter=';')

In [64]:
df1.head()

   client_id  birth_number  district_id
0          1        706213           18
1          2        450204            1
2          3        406009            1
3          4        561201            5
4          5        605703            5

In [65]:

# Function to convert birth number to birthdate
def decode_birth_number(birth_number):
    birth_str = str(birth_number).zfill(6)  # Ensure the birth number is 6 digits
    year = int("19"+birth_str[:2])
    month = int(birth_str[2:4])
    day = int(birth_str[4:])
    
    if month > 50:
        month -= 50
        gender = 'Female'
    else:
        gender = 'Male'
    
    birthdate = pd.Timestamp(year=year, month=month, day=day)
    return birthdate, gender

# Decode birth numbers
df1['Birth_date'], df1['Gender'] = zip(*df1['birth_number'].apply(decode_birth_number))

In [66]:
df1 = df1.drop(columns="birth_number")

In [67]:
df1

      client_id  district_id Birth_date  Gender
0             1           18 1970-12-13  Female
1             2            1 1945-02-04    Male
2             3            1 1940-10-09  Female
3             4            5 1956-12-01    Male
4             5            5 1960-07-03  Female
...         ...          ...        ...     ...
5364      13955            1 1945-10-30  Female
5365      13956            1 1943-04-06    Male
5366      13968           61 1968-04-13    Male
5367      13971           67 1962-10-19  Female
5368      13998           74 1953-08-12  Female

[5369 rows x 4 columns]

In [68]:
df2 = pd.read_csv('transaction.csv')

In [69]:
df2 =df2.drop(columns='Unnamed: 0')

In [70]:
df2

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,1993-01-01,Credit,Credit_In_Cash,700.0,700.0,Unknown,Unknown,Unknown
1,171812,576,1993-01-01,Credit,Credit_In_Cash,900.0,900.0,Unknown,Unknown,Unknown
2,207264,704,1993-01-01,Credit,Credit_In_Cash,1000.0,1000.0,Unknown,Unknown,Unknown
3,1117247,3818,1993-01-01,Credit,Credit_In_Cash,600.0,600.0,Unknown,Unknown,Unknown
4,579373,1972,1993-01-02,Credit,Credit_In_Cash,400.0,400.0,Unknown,Unknown,Unknown
...,...,...,...,...,...,...,...,...,...,...
1056315,3626622,2906,1998-12-31,Credit,Unknown,62.3,13729.4,Interest_Credited,Unknown,Unknown
1056316,3627616,2935,1998-12-31,Credit,Unknown,81.3,19544.9,Interest_Credited,Unknown,Unknown
1056317,3625403,2869,1998-12-31,Credit,Unknown,60.2,14638.2,Interest_Credited,Unknown,Unknown
1056318,3626683,2907,1998-12-31,Credit,Unknown,107.5,23453.0,Interest_Credited,Unknown,Unknown
1056319,3626540,2902,1998-12-31,Credit,Unknown,164.1,41642.9,Interest_Credited,Unknown,Unknown

In [71]:
df2['date']= pd.to_datetime(df2['date'])

In [72]:
df2['date'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1056320 entries, 0 to 1056319
Series name: date
Non-Null Count    Dtype
--------------    -----
1056320 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 8.1 MB

In [73]:
df2 = df2.rename(columns={"k_symbol":"Payment Type"})

In [74]:
df3= pd.read_csv('account.csv', delimiter=';')

In [75]:
df3

      account_id  district_id         frequency    date
0            576           55  POPLATEK MESICNE  930101
1           3818           74  POPLATEK MESICNE  930101
2            704           55  POPLATEK MESICNE  930101
3           2378           16  POPLATEK MESICNE  930101
4           2632           24  POPLATEK MESICNE  930102
...          ...          ...               ...     ...
4495         124           55  POPLATEK MESICNE  971228
4496        3958           59  POPLATEK MESICNE  971228
4497         777           30  POPLATEK MESICNE  971228
4498        1573           63  POPLATEK MESICNE  971229
4499        3276            1  POPLATEK MESICNE  971229

[4500 rows x 4 columns]

In [76]:
df3['frequency'].value_counts()

frequency
POPLATEK MESICNE      4167
POPLATEK TYDNE         240
POPLATEK PO OBRATU      93
Name: count, dtype: int64

In [77]:
df3['A/C Creation Date']= pd.to_datetime(df3['date'], format="%y%m%d")

In [78]:
df3= df3.drop(columns='date')

In [79]:
df3['frequency']= df3['frequency'].map({'POPLATEK MESICNE':'Monthly Insuance', 'POPLATEK TYDNE':'Weekly Issuance','POPLATEK PO OBRATU':'Issuance After tnx'})

In [80]:
df3.isnull().sum()

account_id           0
district_id          0
frequency            0
A/C Creation Date    0
dtype: int64

In [81]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4500 entries, 0 to 4499
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   account_id         4500 non-null   int64
 1   district_id        4500 non-null   int64
 2   frequency          4500 non-null   object
 3   A/C Creation Date  4500 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 140.8+ KB

In [82]:
loan = pd.read_csv('loan.csv', delimiter=';')

In [83]:
loan

     loan_id  account_id    date  amount  duration  payments status
0       5314        1787  930705   96396        12    8033.0      B
1       5316        1801  930711  165960        36    4610.0      A
2       6863        9188  930728  127080        60    2118.0      A
3       5325        1843  930803  105804        36    2939.0      A
4       7240       11013  930906  274740        60    4579.0      A
..       ...         ...     ...     ...       ...       ...    ...
677     4989         105  981205  352704        48    7348.0      C
678     5221        1284  981205   52512        12    4376.0      C
679     6402        6922  981206  139488        24    5812.0      C
680     5346        1928  981206   55632        24    2318.0      C
681     6748        8645  981208  240900        60    4015.0      C

[682 rows x 7 columns]

## Pushing data in Sql

In [ ]:
import warnings
warnings.filterwarnings("ignore")
from sqlalchemy import create_engine
import pandas as pd

In [ ]:
engine = create_engine('mysql+mysqldb://root:737480@127.0.0.1:3306/credit_card')

In [ ]:
conn = engine.connect()

In [ ]:
data.to_sql('Account', engine, index=False, if_exists="replace")
conn.close()